Config/Documents/Закрытие20_01.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Закрытие20_01</Name>
			<Comment>Закрытие 20.01 счета</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа_20</Name>
					<Comment>Номенклатурная группа счета 20.01</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРаспределять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабЧастьКоэфф</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа_20</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа_90</Name>
							<Comment>Номенклатурная группа счета 90.02.1 (90.08.1)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Config/Documents/Закрытие20_01/Ext/ObjectModule.bsl
Функция СформироватьЗапросПоНомГруппе_20(НомГруппа)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НачПериода",НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонПериода",КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Счет",ПланыСчетов.Хозрасчетный.ОсновноеПроизводство);
	Запрос.УстановитьПараметр("НомГруппа",НомГруппа);

	Запрос.Текст ="ВЫБРАТЬ
	              |	ХозрасчетныйОбороты.Подразделение КАК Подразделение,
				  |	ХозрасчетныйОбороты.Субконто1 КАК НомГруппа,
	          	  |	ХозрасчетныйОбороты.Субконто2 КАК СтатьяЗатрат,
	              |	ХозрасчетныйОбороты.СуммаОборотДт,
	              |	ХозрасчетныйОбороты.СуммаНУОборотДт	             
	              |ИЗ
	              |	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачПериода, &КонПериода, , , , , , ) КАК ХозрасчетныйОбороты
	              |ГДЕ
	              |	ХозрасчетныйОбороты.Организация = &Организация
	              |	И ХозрасчетныйОбороты.Счет = &Счет
				  |	И ХозрасчетныйОбороты.Субконто1 = &НомГруппа 
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Подразделение";

  Возврат Запрос;	
	
КонецФункции

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Если Организация = Справочники.Организации.ПустаяСсылка() Тогда
		Сообщить ("Не выбрана организация");
		Возврат;
	КонецЕсли;
	
	Если (НеРаспределять = Ложь) И (НоменклатурнаяГруппа_20 = Справочники.НоменклатурныеГруппы.ПустаяСсылка()) Тогда
		Сообщить ("Не выбрана номенклатурная группа Кт счета 20.01");
		Возврат;
	КонецЕсли;
	
	// Если не распределяем тогда коэффициент равен единице
	Если НеРаспределять = Истина Тогда
		Для Каждого ТекСтрока Из ТабЧастьКоэфф Цикл
			Запрос = СформироватьЗапросПоНомГруппе_20(ТекСтрока.НоменклатурнаяГруппа_20);
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать(); 			
			Пока Выборка.Следующий() Цикл
				СуммаРаспр = Выборка.СуммаОборотДт;
				СуммаРаспрНУ = Выборка.СуммаНУОборотДт;
				Движение = Движения.Хозрасчетный.Добавить();
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.СчетДт = ПланыСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД;
				Движение.СчетКт = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
				Движение.ПодразделениеКт = Выборка.Подразделение;
				Движение.Сумма = СуммаРаспр;
				Если СуммаРаспр<>СуммаРаспрНУ Тогда
					//Сообщить("Обнаружены разницы между БУ и НУ");
					Движение.СуммаНУДт = СуммаРаспрНУ;
					Движение.СуммаВРДт = СуммаРаспр-СуммаРаспрНУ;
					Движение.СуммаНУКт = СуммаРаспрНУ;
					Движение.СуммаВРКт = СуммаРаспр-СуммаРаспрНУ;
				КонецЕсли; 				
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы] = ТекСтрока.НоменклатурнаяГруппа_90;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы] = ТекСтрока.НоменклатурнаяГруппа_20;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат] = Выборка.СтатьяЗатрат;				
				
			КонецЦикла;  			
		КонецЦикла;	
		
	Иначе		
		
		// Если распределяем тогда сумма коэффициентов таб.части должна равняться единице

		СуммаКоэфф = 0;
		
		Для Каждого ТекСтрока Из ТабЧастьКоэфф Цикл
			СуммаКоэфф = СуммаКоэфф+ТекСтрока.Коэффициент;	
		КонецЦикла;	
		
		Если СуммаКоэфф <> 1 Тогда
			Сообщить("Сумма коэффициентов распределения должна равняться единице");
			Возврат;
		КонецЕсли;
		
		СЧ = ТабЧастьКоэфф.Количество();		
		
		Запрос = СформироватьЗапросПоНомГруппе_20(НоменклатурнаяГруппа_20);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
    	Пока Выборка.Следующий() Цикл
			СуммаОст=0;
			СуммаОстНУ=0;
			Для Каждого ТекСтрока Из ТабЧастьКоэфф Цикл
								
				Если ТекСтрока.НомерСтроки<СЧ Тогда
					СуммаРаспр = Окр(Выборка.СуммаОборотДт*ТекСтрока.Коэффициент,2);
					СуммаРаспрНУ = Окр(Выборка.СуммаНУОборотДт*ТекСтрока.Коэффициент,2);
					СуммаОст = СуммаОст+СуммаРаспр;
					СуммаОстНУ = СуммаОстНУ+СуммаРаспрНУ; 
				Иначе 
					СуммаРаспр = Выборка.СуммаОборотДт-СуммаОст;
					СуммаРаспрНУ = Выборка.СуммаНУОборотДт-СуммаОстНУ; 
				КонецЕсли;
				
					Движение = Движения.Хозрасчетный.Добавить();
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.СчетДт = ПланыСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД;
					Движение.СчетКт = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
					Движение.ПодразделениеКт = Выборка.Подразделение;
					Движение.Сумма = СуммаРаспр;
					Если СуммаРаспр<>СуммаРаспрНУ Тогда
						//Сообщить("Обнаружены разницы между БУ и НУ");
						Движение.СуммаНУДт = СуммаРаспрНУ;
						Движение.СуммаВРДт = СуммаРаспр-СуммаРаспрНУ;
						Движение.СуммаНУКт = СуммаРаспрНУ;
						Движение.СуммаВРКт = СуммаРаспр-СуммаРаспрНУ;
					КонецЕсли; 				
					Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы] = ТекСтрока.НоменклатурнаяГруппа_90;
					Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы] = НоменклатурнаяГруппа_20;
					Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат] = Выборка.СтатьяЗатрат;				
				
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
		Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры
